app/controllers/languages_controller.rb

SELECT "languages".* FROM "languages"
---
	def index
		languages = Language.all