app/controllers/lessons_controller.rb

SELECT  "languages".* FROM "languages"  WHERE "languages"."name" = 'javaScript'  ORDER BY "languages"."id" ASC LIMIT 1
---
	def index

		lessons = Language.where(name: params[:track_name]).first.lessons