app/controllers/performances_controller.rb

	def create
		incorrect_characters = params[:new_performance][:missed_characters]
		puts incorrect_characters
		most_missed = {}

		# USER
		if user_signed_in?
			new_performance = current_user.performances.new(performance_params)

			if new_performance.save
---
INSERT INTO "performances" ("created_at", "missed_characters", "number_missed", "script_id", "time_elapsed", "total_characters", "updated_at", "user_id", "wpm") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"