app/controllers/posts_controller.rb

  def index

    # Gather all post data
    posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
  	# Create and save new post from data received from the client
    new_post = Post.new
    new_post.title = params[:new_post][:title][0...250] # Get only first 250 characters
    new_post.contents = params[:new_post][:contents]

    # Confirm post is valid and save or return HTTP error
    if new_post.valid?
      new_post.save!
---
INSERT INTO "posts" ("contents", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["contents", "new post from client side..."], ["created_at", "2014-06-13 03:29:09.549206"], ["title", "hello!"], ["updated_at", "2014-06-13 03:29:09.549206"]]