app/controllers/scripts_controller.rb

SELECT  "lessons".* FROM "lessons"  WHERE "lessons"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "scripts".* FROM "scripts"  WHERE "scripts"."lesson_id" = $1  [["lesson_id", 1]]
---
	def index
		p params
		scripts = Lesson.find(params[:lesson_id]).scripts

SELECT  "scripts".* FROM "scripts"  WHERE "scripts"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		p params
		current_script = Script.find(params[:script_id]).text