app/controllers/scripts_controller.rb

	def index
		p params
		scripts = Script.all
---
SELECT "scripts".* FROM "scripts"